layer {
  name: "mnist"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mean_file: "/home/ubuntu/digits/DIGITS/digits/jobs/20151130-235952-5484/mean.binaryproto"
  }
  data_param {
    source: "/home/ubuntu/digits/DIGITS/digits/jobs/20151130-235952-5484/train_db"
    batch_size: 64
    backend: LMDB
  }
}
layer {
  name: "mnist"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mean_file: "/home/ubuntu/digits/DIGITS/digits/jobs/20151130-235952-5484/mean.binaryproto"
  }
  data_param {
    source: "/home/ubuntu/digits/DIGITS/digits/jobs/20151130-235952-5484/val_db"
    batch_size: 100
    backend: LMDB
  }
}
layer {
  name: "scale"
  type: "Power"
  bottom: "data"
  top: "scale"
  power_param {
    scale: 0.0125
  }
}
layer {
  name: "conv1_c12"
  type: "Convolution"
  bottom: "scale"
  top: "conv1_c12"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "pool1_c12"
  type: "Pooling"
  bottom: "conv1_c12"
  top: "pool1_c12"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "relu1_c12"
  type: "ReLU"
  bottom: "pool1_c12"
  top: "pool1_c12"
}
layer {
  name: "fc1_c12"
  type: "InnerProduct"
  bottom: "pool1_c12"
  top: "fc1_c12"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2_c12"
  type: "ReLU"
  bottom: "fc1_c12"
  top: "fc1_c12"
}
layer {
  name: "fc2_c12"
  type: "InnerProduct"
  bottom: "fc1_c12"
  top: "fc2_c12"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "loss_c12"
  type: "SoftmaxWithLoss"
  bottom: "fc2_c12"
  bottom: "label"
  top: "loss_c12"
}
layer {
  name: "accuracy_c12"
  type: "Accuracy"
  bottom: "fc2_c12"
  bottom: "label"
  top: "accuracy_c12"
  include {
    phase: TEST
  }
}
